solvers/explosiveSonicFoam/tut/perfectGas/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
xMin -40;
yMin 0;
zMin -24;

xMax  40;
yMax  8;
zMax  24;


vertices
(
    ($xMin $yMin $zMin)
    ($xMax $yMin $zMin)
    ($xMax $yMax $zMin)
    ($xMin $yMax $zMin)

    ($xMin $yMin $zMax)
    ($xMax $yMin $zMax)
    ($xMax $yMax $zMax)
    ($xMin $yMax $zMax)
);

blocks
(
   // hex (0 1 2 3 4 5 6 7) (50 5 30) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (100 10 60) simpleGrading (1 1 1)
   //  hex (0 1 2 3 4 5 6 7) (40 10 22) simpleGrading (1 1 1)	
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    ground
    {
        type wall;
        faces
        (
	    (1 5 4 0)	
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
