solvers/explosiveSonicFoam/tut/perfectGas/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind;//limitedLinearV 1;
    div(phiv,p)     Gauss upwind;//limitedLinear 1;
    div(phi,K)      Gauss upwind;//limitedLinear 1;
    div(U)          Gauss upwind;//limitedLinear phi 1;
    div(phi,k)      Gauss upwind;//limitedLinear 1;
    div(phi,Yi)     Gauss upwind;//limitedLinear01 1;
    div(phi,T)      Gauss upwind;//limitedLinear 1;
    div(phid,p)     Gauss upwind;//limitedLinear 1;
    div(phi,A)      Gauss upwind;//limitedLinearV 1;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear; 
    div(phi,e)      Gauss upwind;//limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
